import React from "react";


const AboutBox = () => {
  return (
    <section className="section" id="about">
      <div className="top-header">
        <h1>About ตั้งหวังเจ๊ง</h1>
      </div>
      <div className="row">
        {/**About Me */}
        <div className="col">
          <div className="about-info">
            <h3>By ตั้งหวังเจ๊ง</h3>
            <p>
            ยินดีต้อนรับสู่ ตั้งหวังเจ๊ง! เราคือแหล่งรวมโน๊ตบุ๊คคุณภาพสูงที่ตอบโจทย์ทุกความต้องการ ไม่ว่าคุณจะเป็นนักเรียน นักศึกษา มืออาชีพ หรือผู้ที่ชื่นชอบเทคโนโลยี โน๊ตบุ๊คของเราถูกคัดสรรมาเพื่อให้คุณสามารถทำงาน เรียนรู้ และสร้างสรรค์ผลงานได้อย่างมีประสิทธิภาพ

เรามีโน๊ตบุ๊คจากแบรนด์ชั้นนำมากมาย เช่น Dell , HP , Lenovo , Apple , Asus และอื่นๆอีกมากมาย โดยมุ่งเน้นที่คุณภาพ การออกแบบที่สวยงาม และฟังก์ชันการใช้งานที่หลากหลาย นอกจากนี้ เรายังมีทีมงานมืออาชีพพร้อมให้คำแนะนำและบริการหลังการขายเพื่อให้คุณมั่นใจในทุกการเลือกซื้อ

ที่ ตั้งหวังเจ๊ง เราเชื่อว่าการมีโน๊ตบุ๊คที่ดีจะช่วยเปลี่ยนแปลงชีวิตของคุณให้ดีขึ้น พร้อมให้คุณก้าวเข้าสู่ยุคดิจิทัลอย่างมั่นใจ มาร่วมค้นหาโน๊ตบุ๊คในฝันของคุณกับเราได้แล้ววันนี้!
            </p>
            <div className="about-btn">
            </div>
          </div>
        </div>
        {/**Skills */}
        <div className="col">
          <div className="skills-box">
            <div className="skills-header">
              <h3>ยี่ห้อที่ทางเราเเนะนำ🫶🏻</h3>
            </div>
            <div className="skills-list">
              <span>Acer - โน๊ตบุ๊ค Acer มีหลากหลายรุ่นในราคาที่เข้าถึงได้ เช่น Aspire และ Predator ที่เหมาะสำหรับการเล่นเกม</span>
              <span>Microsoft - Surface Series จาก Microsoft มีดีไซน์ที่พกพาสะดวกและระบบปฏิบัติการ Windows ที่ใช้งานง่าย</span>
              <span>Razer - Razer มีโน๊ตบุ๊คสำหรับเกมเมอร์ที่มีประสิทธิภาพสูง เช่น Razer Blade ซึ่งเหมาะสำหรับการเล่นเกมและการสร้างสรรค์</span>
              <span>Toshiba - โน๊ตบุ๊ค Toshiba มีความทนทานและราคาเหมาะสม เช่น Dynabook และ Satellite</span>
              <span>Samsung - โน๊ตบุ๊ค Samsung มีดีไซน์ที่ทันสมัยและคุณสมบัติที่ดี เช่น Galaxy Book Series</span>
              <span>LG - LG มีโน๊ตบุ๊คที่มีความบางเบาและน้ำหนักเบา เช่น LG Gram เหมาะสำหรับการพกพา</span>
            
            </div>
          </div>
          
         
          
        </div>
      </div>
    </section>
  );
};

export default AboutBox;
